#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_service_account.gke_nodes: Refreshing state... [id=projects/satya-k8-poc/serviceAccounts/my-gke-cluster-gke-nodes@satya-k8-poc.iam.gserviceaccount.com]
google_compute_network.vpc: Refreshing state... [id=projects/satya-k8-poc/global/networks/my-gke-cluster-vpc]
google_project_iam_member.gke_nodes_resource_metadata_writer: Refreshing state... [id=satya-k8-poc/roles/stackdriver.resourceMetadata.writer/serviceAccount:my-gke-cluster-gke-nodes@satya-k8-poc.iam.gserviceaccount.com]
google_project_iam_member.gke_nodes_monitoring_viewer: Refreshing state... [id=satya-k8-poc/roles/monitoring.viewer/serviceAccount:my-gke-cluster-gke-nodes@satya-k8-poc.iam.gserviceaccount.com]
google_project_iam_member.gke_nodes_metric_writer: Refreshing state... [id=satya-k8-poc/roles/monitoring.metricWriter/serviceAccount:my-gke-cluster-gke-nodes@satya-k8-poc.iam.gserviceaccount.com]
google_project_iam_member.gke_nodes_log_writer: Refreshing state... [id=satya-k8-poc/roles/logging.logWriter/serviceAccount:my-gke-cluster-gke-nodes@satya-k8-poc.iam.gserviceaccount.com]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/satya-k8-poc/regions/us-central1/subnetworks/my-gke-cluster-subnet]
google_container_cluster.primary: Refreshing state... [id=projects/satya-k8-poc/locations/us-central1-a/clusters/my-gke-cluster]
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/satya-k8-poc/locations/us-central1-a/clusters/my-gke-cluster/nodePools/my-gke-cluster-node-pool]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr                        = "10.1.0.0/16" -> (known after apply)
      + datapath_provider                        = (known after apply)
      ~ default_max_pods_per_node                = 110 -> (known after apply)
      - enable_autopilot                         = false -> null
      ~ enable_intranode_visibility              = false -> (known after apply)
      - enable_tpu                               = false -> null
      ~ endpoint                                 = "146.148.73.30" -> (known after apply)
      ~ id                                       = "projects/satya-k8-poc/locations/us-central1-a/clusters/my-gke-cluster" -> (known after apply)
      ~ label_fingerprint                        = "a9dc16a7" -> (known after apply)
      ~ location                                 = "us-central1-a" -> "us-central1-a-a" # forces replacement
      ~ logging_service                          = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version                           = "1.33.5-gke.1308000" -> (known after apply)
      ~ monitoring_service                       = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                                     = "my-gke-cluster"
      ~ network                                  = "projects/satya-k8-poc/global/networks/my-gke-cluster-vpc" -> "my-gke-cluster-vpc"
      ~ networking_mode                          = "VPC_NATIVE" -> (known after apply)
      ~ node_locations                           = [] -> (known after apply)
      ~ node_version                             = "1.33.5-gke.1308000" -> (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      ~ project                                  = "satya-k8-poc" -> (known after apply)
      - resource_labels                          = {} -> null
      ~ self_link                                = "https://container.googleapis.com/v1/projects/satya-k8-poc/zones/us-central1-a/clusters/my-gke-cluster" -> (known after apply)
      ~ services_ipv4_cidr                       = "10.2.0.0/16" -> (known after apply)
      ~ subnetwork                               = "projects/satya-k8-poc/regions/us-central1/subnetworks/my-gke-cluster-subnet" -> "my-gke-cluster-subnet"
      + tpu_ipv4_cidr_block                      = (known after apply)
        # (9 unchanged attributes hidden)

      ~ addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }

            # (2 unchanged blocks hidden)
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - auto_provisioning_locations = [] -> null
          - autoscaling_profile         = "BALANCED" -> null
          - enabled                     = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.1.0.0/16" -> (known after apply)
          ~ services_ipv4_cidr_block      = "10.2.0.0/16" -> (known after apply)
            # (3 unchanged attributes hidden)

          - pod_cidr_overprovision_config {
              - disabled = false -> null
            }
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ maintenance_policy {
          ~ daily_maintenance_window {
              ~ duration   = "PT4H0M0S" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQU4xNlZsT1lPaCtrNnV3SVhPaWJnMlF3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa01tWmlOVGd6TTJZdE9EVmpPQzAwWVRjM0xUbGtNMlF0TjJWaE5XSXhaakUwTURReApNQ0FYRFRJMU1USXhNREF5TlRjME5sb1lEekl3TlRVeE1qQXpNRE0xTnpRMldqQXZNUzB3S3dZRFZRUURFeVF5ClptSTFPRE16WmkwNE5XTTRMVFJoTnpjdE9XUXpaQzAzWldFMVlqRm1NVFF3TkRFd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FEWGF1QVdnNjZoSERsdkpTZ01JN1dXV2JQK2ZBZUlhQUZBSWpXbQpIKysxZDQ5ZGxxR09VOEVDWENneTI4YU1maVhyakVYcEoxN0lSdEpZL2FpNXJTLzRmMGMweVBEbzFhTVZwdUQ2Ci8rblNBMFZMYWpZZk9tR0Z5RVJVVSs5VGh4MzlqMEtuSTMyVk1KZlNZNm1aQ3dNVVRvK2hXL2s5RXkxTm1JMnkKZzRXM2gxcjN5WkRFbklpVlErWW9ZQVIxa1NNMTN6K0c5OE1LenRPZmRXdWlJVzNYQTgrUVVZUzR4d2pNdFJldgpkcW5FY3NWbnZQSExuZC85bHlWd05TNjdsSmUxdGdmYVRoamhWWGxBOXVkN0NMdTcxTTNBMmhGa0JwMEhubzhqCmtvdDc4OC9BMWR4T0hBVENjenFwemRsMTZEMzF1RmxZRFRpRmhpMlBUdCtKd2pBc3RmODRDR0txbnBrUHJWN2kKYUZPY2Q1N1QwQkNBZ3dKd2hOY3ZsaDB3aGwySjF2U1BSRjNETVV3RHpnK0luZW1acmp6NDg2aGhxc2Rtc0VQRApHVmFVNkxGMWVDaVI1ZHpNdVM1ZURDeHNCT2Y1bS9mQWlEYjVMVll6emc1VnVacVpEbGowMDI4Z3ZKcmF5TmFpCmxTVDRFMXN5VU44bDdyQm1YOXpZODNSSG51RUNBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGREN0alFVYlkwN050YUg0UnpaY2htbzdNSjUvTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQStWWFR5cTZ5NnJURFVSK3IzODRXQ0ZXR2hCZlNPMTloOENYR0dKcDZCClE3UkN3RmQreXZIQ0VNbExTS1Y2bVhhZ3BodVFZdGVHQjdRWms1bDZZL2pnK0FlZXRJNmRaMkg1Ni85bHZTdk0KWExwWnJYOWZubk40NzFlWHdwRkpiNnViWnlPL2xVZXROZW1kVmNtTDhDazc1ZWdFaUlhV3BQOXBZeDByYWpaNgpqREVoNDB3V1M3Q2RPNC9HMjhDWGg3WlFnSWxST1VwQnVZZFFmRFpZdlBkMEU0UThiVmRUQkxIN240UmszMFZGCkxoRkFPNjRQcGdvcHRlTzFIaWY1c3o4Tm1NdktuM2F6TU94dXZ4MG9vMUoybHQ2d1lIOEhHQ3huQUVqZDdGeTcKOUhjbkpGaENXWEJjdjR1Y2hKTDNzc3RmUjMrRmpuM2IzM0JGUWxjV0dtMHg4ZFBvM2w1SFRQMk43aXdYWTFQOQpYTVVpeGpFQkQzWG1ucTVmN21Ta0FqSEtRRGVPM2YxOGxlZVpEMFk0b1JKQVd5TXp5TW1pSmQ4S0hyejdJR3RBCnMrd0lyb0xEU3lwdk5HNVE3bS9sQTFJSW1LK0dIaDRqaFU5K29GSXNvenU3bCtOTXV5YkFyVWVIR2wvUEJ6TzgKQVYzVVNZamxWOGlGY28veGNRd2g3NTA9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      ~ master_authorized_networks_config {
          ~ gcp_public_cidrs_access_enabled = false -> (known after apply)

            # (1 unchanged block hidden)
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "STORAGE",
              - "HPA",
              - "POD",
              - "DAEMONSET",
              - "DEPLOYMENT",
              - "STATEFULSET",
              - "JOBSET",
              - "CADVISOR",
              - "KUBELET",
              - "DCGM",
            ] -> null

          - advanced_datapath_observability_config {
              - enable_metrics = false -> null
              - enable_relay   = false -> null
              - relay_mode     = "DISABLED" -> null
            }

          - managed_prometheus {
              - enabled = true -> null
            }
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      - node_config {
          - disk_size_gb                = 30 -> null
          - disk_type                   = "pd-standard" -> null
          - effective_taints            = [] -> null
          - enable_confidential_storage = false -> null
          - guest_accelerator           = [] -> null
          - image_type                  = "COS_CONTAINERD" -> null
          - labels                      = {
              - "env" = "dev"
            } -> null
          - local_ssd_count             = 0 -> null
          - logging_variant             = "DEFAULT" -> null
          - machine_type                = "e2-small" -> null
          - metadata                    = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes                = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible                 = true -> null
          - resource_labels             = {
              - "goog-gke-node-pool-provisioning-model" = "spot"
            } -> null
          - resource_manager_tags       = {} -> null
          - service_account             = "my-gke-cluster-gke-nodes@satya-k8-poc.iam.gserviceaccount.com" -> null
          - spot                        = false -> null
          - tags                        = [
              - "gke-node",
              - "my-gke-cluster-gke",
            ] -> null

          - kubelet_config {
              - cpu_cfs_quota                          = false -> null
              - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
              - pod_pids_limit                         = 0 -> null
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - node_pool {
          - initial_node_count          = 2 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/satya-k8-poc/zones/us-central1-a/instanceGroupManagers/gke-my-gke-cluster-my-gke-cluster-nod-2bf3f4ec-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/satya-k8-poc/zones/us-central1-a/instanceGroups/gke-my-gke-cluster-my-gke-cluster-nod-2bf3f4ec-grp",
            ] -> null
          - max_pods_per_node           = 110 -> null
          - name                        = "my-gke-cluster-node-pool" -> null
          - node_count                  = 2 -> null
          - node_locations              = [
              - "us-central1-a",
            ] -> null
          - version                     = "1.33.5-gke.1308000" -> null

          - autoscaling {
              - location_policy      = "ANY" -> null
              - max_node_count       = 3 -> null
              - min_node_count       = 1 -> null
              - total_max_node_count = 0 -> null
              - total_min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
              - pod_ipv4_cidr_block  = "10.1.0.0/16" -> null
              - pod_range            = "pods" -> null
            }

          - node_config {
              - disk_size_gb                = 30 -> null
              - disk_type                   = "pd-standard" -> null
              - effective_taints            = [] -> null
              - enable_confidential_storage = false -> null
              - guest_accelerator           = [] -> null
              - image_type                  = "COS_CONTAINERD" -> null
              - labels                      = {
                  - "env" = "dev"
                } -> null
              - local_ssd_count             = 0 -> null
              - logging_variant             = "DEFAULT" -> null
              - machine_type                = "e2-small" -> null
              - metadata                    = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes                = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible                 = true -> null
              - resource_labels             = {
                  - "goog-gke-node-pool-provisioning-model" = "spot"
                } -> null
              - resource_manager_tags       = {} -> null
              - service_account             = "my-gke-cluster-gke-nodes@satya-k8-poc.iam.gserviceaccount.com" -> null
              - spot                        = false -> null
              - tags                        = [
                  - "gke-node",
                  - "my-gke-cluster-gke",
                ] -> null

              - kubelet_config {
                  - cpu_cfs_quota                          = false -> null
                  - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
                  - pod_pids_limit                         = 0 -> null
                }

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }

              - workload_metadata_config {
                  - mode = "GKE_METADATA" -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_auto_config {
          - resource_manager_tags = {} -> null

          - node_kubelet_config {
              - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
              - logging_variant                        = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.0.0.2" -> null
          - public_endpoint         = "146.148.73.30" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - security_posture_config {
          - mode               = "BASIC" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }

        # (2 unchanged blocks hidden)
    }

  # google_container_node_pool.primary_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_nodes" {
      ~ id                          = "projects/satya-k8-poc/locations/us-central1-a/clusters/my-gke-cluster/nodePools/my-gke-cluster-node-pool" -> (known after apply)
      ~ initial_node_count          = 2 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/satya-k8-poc/zones/us-central1-a/instanceGroupManagers/gke-my-gke-cluster-my-gke-cluster-nod-2bf3f4ec-grp",
        ] -> (known after apply)
      ~ location                    = "us-central1-a" -> "us-central1-a-a" # forces replacement
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/satya-k8-poc/zones/us-central1-a/instanceGroups/gke-my-gke-cluster-my-gke-cluster-nod-2bf3f4ec-grp",
        ] -> (known after apply)
      ~ max_pods_per_node           = 110 -> (known after apply)
        name                        = "my-gke-cluster-node-pool"
      + name_prefix                 = (known after apply)
      ~ node_locations              = [
          - "us-central1-a",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.33.5-gke.1308000" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "ANY" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
          - pod_ipv4_cidr_block  = "10.1.0.0/16" -> null
          - pod_range            = "pods" -> null
        }

      ~ node_config {
          ~ effective_taints            = [] -> (known after apply)
          - enable_confidential_storage = false -> null
          ~ guest_accelerator           = [] -> (known after apply)
          ~ image_type                  = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count             = 0 -> (known after apply)
          ~ logging_variant             = "DEFAULT" -> (known after apply)
          + min_cpu_platform            = (known after apply)
          - resource_labels             = {
              - "goog-gke-node-pool-provisioning-model" = "spot"
            } -> null
          - resource_manager_tags       = {} -> null
            tags                        = [
                "gke-node",
                "my-gke-cluster-gke",
            ]
            # (9 unchanged attributes hidden)

          - kubelet_config {
              - cpu_cfs_quota                          = false -> null
              - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
              - pod_pids_limit                         = 0 -> null
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

            # (1 unchanged block hidden)
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_endpoint       = (sensitive value)
  ~ zone                   = "us-central1-a" -> "us-central1-a-a"

Warning: Value for undeclared variable

The root module does not declare a variable named "machine_type" but a value
was found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "max_node_count" but a
value was found in file "terraform.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 3 other variable(s) defined
without being declared.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @satya-aws-iac, Action: `pull_request`, Branch: `25/merge`, Workflow: `Terraform Plan`*